# TASK 1
# Напишите программу, которая принимает на вход 
# вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11

# Ршение//////////////////////////////////////////

# number = input("Веддите число: ")
# sum = 0 
# for i in number:
#     if i.isdigit():
#         sum += int(i)
# print(sum)

# //////////////////////////////////////////////////////////

# TASK 2
# Напишите программу, которая принимает на вход 
# число N и выдает набор произведений чисел от 1 до N.

# Пример:

# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# Ршение//////////////////////////////////////////

# n = int(input("Введите число N: "))
# fact = 1
# a=[]
# for i in range(1, n+1):
#     fact *= i
#     a.append(fact)
# print(a)


# //////////////////////////////////////////////////////////


# TASK 3
# Задайте список из n чисел последовательности 
# (1+ 1/n)^n и выведите на экран их сумму.

# Пример:


# Ршение//////////////////////////////////////////

# n = int(input())
# sum = 0
# some_dict = {}
# for i in range(1, n + 1):
#     some_dict[i] = (1+1/i)**i
# print(some_dict) 

# for i in range(1, n + 1):
#     sum += (1+1/i)**i
# print(sum)


# //////////////////////////////////////////////////////////

# TASK 4
# Задайте список из N элементов, 
# заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в файле file.txt в одной строке одно число.

# Ршение//////////////////////////////////////////

# from random import *
# n = int(input())
# some_list = [randint(-n,n) for _ in range(randint(5,10))]
# print(some_list)

# a= open('test.txt', 'w' )
# for i in range(randint(2,len(some_list))):
#     a.write(str(randint(0,len(some_list)-1))+ '\n')
# a.close()

# pr = 1
# with open('test.txt','r') as a:
#     for i in a.read().splitlines():
#       pr=pr*some_list[int(i)]
# print(pr)    


# //////////////////////////////////////////////////////////



# TASK 5
# Реализуйте алгоритм перемешивания списка.

# Ршение//////////////////////////////////////////

# import random
# some = [2, 3, 7, 5, 11]
# random.shuffle(some)
# print(some)


# //////////////////////////////////////////////////////////